testCases/SiegelKieshock/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	fluid_to_solid
	{
		type	noSlip;
	}
	
	top
	{
		type	zeroGradient;
	}
	
	right
	{
		type	zeroGradient;
	}
	
	front
	{
		type	wedge;
	}
	
	back
	{
		type	wedge;
	}
	
	axis
	{
		type 	empty;
	}
}

